In [1]:
import pandas as pd
import seaborn as sns

In [2]:
df = sns.load_dataset('titanic')

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.6+ KB

In [4]:
df['deck'].value_counts(dropna = False)

NaN    688
C       59
B       47
D       33
E       32
A       15
F       13
G        4
Name: deck, dtype: int64

In [5]:
df.isnull().head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,False,False,False,False,False,False,False,False,False,False,False,True,False,False,False
1,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,False,True,False,False,False
3,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,False,True,False,False,False

In [15]:
df.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

In [17]:
df_thresh = df.dropna(axis = 'columns', thresh=500)

In [19]:
df_age = df.dropna(subset = ['age'], how = 'any', axis = 0 ) # 특정 columns에 한해서 삭제한다.
len(df_age)

714

In [22]:
df.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [23]:
import pandas as pd
import numpy as np 
import seaborn as sns

In [24]:
titanic = sns.load_dataset('titanic')
df = titanic.loc[:,['age','sex','class','fare','survived']]
count, bin_dividers = np.histogram(df['fare'], bins = 3)
print(bin_dividers)

[  0.     170.7764 341.5528 512.3292]

In [25]:
bin_names = ['Low', 'Medium', 'High']
df['fare_bin'] = pd.cut(x = df['fare'], bins = bin_dividers, labels = bin_names, include_lowest = True)
df[['fare', 'fare_bin']].head()

      fare fare_bin
0   7.2500      Low
1  71.2833      Low
2   7.9250      Low
3  53.1000      Low
4   8.0500      Low

In [27]:
df1 = pd.DataFrame({'a':[1, 2, 3], 'b' : [3, 4, 5], 'c' : [4,13,3]})
df2 = pd.DataFrame({'b' : [1,3, 7], 'c' :[7, 7, 7], 'd' : [8, 1, 60] })

In [35]:
df1.append(df2)

     a  b   c     d
0  1.0  3   4   NaN
1  2.0  4  13   NaN
2  3.0  5   3   NaN
0  NaN  1   7   8.0
1  NaN  3   7   1.0
2  NaN  7   7  60.0

In [29]:
pd.concat([df1, df2])

     a  b   c     d
0  1.0  3   4   NaN
1  2.0  4  13   NaN
2  3.0  5   3   NaN
0  NaN  1   7   8.0
1  NaN  3   7   1.0
2  NaN  7   7  60.0

In [37]:
li1 = [1, 2, 3]
li1.append([2, 3, 4])

In [39]:
li1

[1, 2, 3, [2, 3, 4]]